StratifyLabs/StratifyOS-mcu-stm32/src/stm32h735xx/core_set_alternate_func.c
// Copyright 2011-2021 Tyler Gilbert and Stratify Labs, Inc; see LICENSE.md

#include <mcu/core.h>
#include <sos/debug.h>
#include "stm32_local.h"
#include "stm32_pin_local.h"

//#define MCU_TOTAL_PINS (10*16+3)

const alternate_function_entry_t alternate_function_table[MCU_TOTAL_PINS] = {
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, E_TMR_(2), E_TMR_(5), E_TMR_(8), E_TMR(15), E_SPI_(6), RESERVED_, E_USRT(2), E_UART(4), ESDMMC(2), E_I2S_(4), E_ETH_(1), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PA0
  {{ RESERVED_, E_TMR_(2), E_TMR_(5), E_LPTM(3), E_TMR(15), RESERVED_, RESERVED_, E_USRT(2), E_UART(4), E_OSPI(1), E_I2S_(4), E_ETH_(1), E_OSPI(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA1
  {{ RESERVED_, E_TMR_(2), E_TMR_(5), E_LPTM(4), E_TMR(15), RESERVED_, E_OSPI(1), E_USRT(2), E_I2S_(4), RESERVED_, RESERVED_, E_ETH_(1), EMDIOS(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA2
  {{ RESERVED_, E_TMR_(2), E_TMR_(5), E_LPTM(5), E_TMR(15), E_SPI_(6), E_OSPI(1), E_USRT(2), RESERVED_, E_LTDC(1), E_USB_(1), E_ETH_(1), E_OSPI(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA3
  {{ RESERVED_, RESERVED_, E_TMR_(5), RESERVED_, RESERVED_, E_SPI_(1), E_SPI_(3), E_USRT(2), E_SPI_(6), RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PA4
  {{ RESERVED_, E_TMR_(2), RESERVED_, E_TMR_(8), RESERVED_, E_SPI_(1), RESERVED_, RESERVED_, E_SPI_(6), RESERVED_, E_USB_(1), RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PA5
  {{ RESERVED_, E_TMR_(1), E_TMR_(3), E_TMR_(8), RESERVED_, E_SPI_(1), E_OSPI(1), RESERVED_, E_SPI_(6), E_TMR(13), E_TMR_(8), EMDIOS(1), E_TMR_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PA6
  {{ RESERVED_, E_TMR_(1), E_TMR_(3), E_TMR_(8), RESERVED_, E_SPI_(1), RESERVED_, RESERVED_, E_SPI_(6), E_TMR(14), E_OSPI(1), E_ETH_(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA7
  {{ E_MCO_(1), E_TMR_(1), RESERVED_, E_TMR_(8), E_I2C_(3), RESERVED_, E_I2C_(5), E_USRT(1), RESERVED_, RESERVED_, E_USB_(1), E_UART(7), E_TMR_(8), E_LTDC(1), E_LTDC(1), E_SYS_(1)}}, //PA8
  {{ RESERVED_, E_TMR_(1), RESERVED_, ELUART(1), E_I2C_(3), E_SPI_(2), E_I2C_(5), E_USRT(1), RESERVED_, RESERVED_, RESERVED_, E_ETH_(1), RESERVED_, E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PA9
  {{ RESERVED_, E_TMR_(1), RESERVED_, ELUART(1), RESERVED_, RESERVED_, RESERVED_, E_USRT(1), RESERVED_, RESERVED_, E_USB_(1), EMDIOS(1), E_LTDC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PA10
  {{ RESERVED_, E_TMR_(1), RESERVED_, ELUART(1), RESERVED_, E_SPI_(2), E_UART(4), E_USRT(1), RESERVED_, EFDCAN(1), E_USB_(1), RESERVED_, RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA11
  {{ RESERVED_, E_TMR_(1), RESERVED_, ELUART(1), RESERVED_, E_SPI_(2), E_UART(4), E_USRT(1), E_I2S_(4), EFDCAN(1), E_USB_(1), RESERVED_, E_TMR_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA12
  {{ E_SYS_(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PA13
  {{ E_SYS_(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PA14
  {{ E_SYS_(1), E_TMR_(2), RESERVED_, RESERVED_, E_CEC_(1), E_SPI_(1), E_SPI_(3), E_SPI_(6), E_UART(4), E_LTDC(1), RESERVED_, E_UART(7), RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PA15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, E_TMR_(1), E_TMR_(3), E_TMR_(8), E_OSPI(1), RESERVED_, E_DFSD(1), RESERVED_, E_UART(4), E_LTDC(1), E_USB_(1), E_ETH_(1), RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB0
  {{ RESERVED_, E_TMR_(1), E_TMR_(3), E_TMR_(8), E_OSPI(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, E_LTDC(1), E_USB_(1), E_ETH_(1), RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB1
  {{ E_RTC_(1), E_I2S_(4), E_I2S_(1), RESERVED_, E_DFSD(1), RESERVED_, E_I2S_(1), E_SPI_(3), E_I2S_(4), E_OSPI(1), E_OSPI(1), E_ETH_(1), RESERVED_, E_TMR(23), RESERVED_, E_SYS_(1)}}, //PB2
  {{ E_SYS_(1), E_TMR_(2), RESERVED_, RESERVED_, RESERVED_, E_SPI_(1), E_SPI_(3), RESERVED_, E_SPI_(6), ESDMMC(2), E_CRS_(1), E_UART(7), RESERVED_, RESERVED_, E_TMR(24), E_SYS_(1)}}, //PB3
  {{ E_SYS_(1), E_TMR(16), E_TMR_(3), RESERVED_, RESERVED_, E_SPI_(1), E_SPI_(3), E_SPI_(2), E_SPI_(6), ESDMMC(2), RESERVED_, E_UART(7), RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PB4
  {{ RESERVED_, E_TMR(17), E_TMR_(3), E_LTDC(1), E_I2C_(1), E_SPI_(1), E_I2C_(4), E_SPI_(3), E_SPI_(6), EFDCAN(2), E_USB_(1), E_ETH_(1), E_FMC_(1), E_PSSI(1), E_UART(5), E_SYS_(1)}}, //PB5
  {{ RESERVED_, E_TMR(16), E_TMR_(4), RESERVED_, E_I2C_(1), E_CEC_(1), E_I2C_(4), E_USRT(1), ELUART(1), EFDCAN(2), E_OSPI(1), E_DFSD(1), E_FMC_(1), E_PSSI(1), E_UART(5), E_SYS_(1)}}, //PB6
  {{ RESERVED_, E_TMR(17), E_TMR_(4), RESERVED_, E_I2C_(1), RESERVED_, E_I2C_(4), E_USRT(1), ELUART(1), RESERVED_, RESERVED_, E_DFSD(1), E_FMC_(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PB7
  {{ RESERVED_, E_TMR(16), E_TMR_(4), E_DFSD(1), E_I2C_(1), RESERVED_, E_I2C_(4), ESDMMC(1), E_UART(4), EFDCAN(1), ESDMMC(2), E_ETH_(1), ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PB8
  {{ RESERVED_, E_TMR(17), E_TMR_(4), E_DFSD(1), E_I2C_(1), E_SPI_(2), E_I2C_(4), ESDMMC(1), E_UART(4), EFDCAN(1), ESDMMC(2), E_I2C_(4), ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PB9
  {{ RESERVED_, E_TMR_(2), RESERVED_, E_LPTM(2), E_I2C_(2), E_SPI_(2), E_DFSD(1), E_USRT(3), RESERVED_, E_OSPI(1), E_USB_(1), E_ETH_(1), RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB10
  {{ RESERVED_, E_TMR_(2), RESERVED_, E_LPTM(2), E_I2C_(2), RESERVED_, E_DFSD(1), E_USRT(3), RESERVED_, RESERVED_, E_USB_(1), E_ETH_(1), RESERVED_, RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB11
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_OSPI(1), E_I2C_(2), E_SPI_(2), E_DFSD(1), E_USRT(3), RESERVED_, EFDCAN(2), E_USB_(1), E_ETH_(1), E_OSPI(1), E_TMR_(1), E_UART(5), E_SYS_(1)}}, //PB12
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_LPTM(2), E_OSPI(1), E_SPI_(2), E_DFSD(1), E_USRT(3), RESERVED_, EFDCAN(2), E_USB_(1), E_ETH_(1), ESDMMC(1), E_PSSI(1), E_UART(5), E_SYS_(1)}}, //PB13
  {{ RESERVED_, E_TMR_(1), E_TMR(12), E_TMR_(8), E_USRT(1), E_SPI_(2), E_DFSD(1), E_USRT(3), E_UART(4), ESDMMC(2), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB14
  {{ E_RTC_(1), E_TMR_(1), E_TMR(12), E_TMR_(8), E_USRT(1), E_SPI_(2), E_DFSD(1), RESERVED_, E_UART(4), ESDMMC(2), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PB15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, E_FMC_(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, E_I2S_(4), E_FMC_(1), E_USB_(1), E_LTDC(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PC0
  {{ E_SYS_(1), E_I2S_(4), E_I2S_(1), E_DFSD(1), E_DFSD(1), E_SPI_(2), E_I2S_(1), RESERVED_, E_I2S_(4), ESDMMC(2), E_OSPI(1), E_ETH_(1), EMDIOS(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PC1
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_OSPI(1), E_SPI_(2), E_DFSD(1), RESERVED_, RESERVED_, E_OSPI(1), E_USB_(1), E_ETH_(1), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PC2
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_OSPI(1), E_SPI_(2), RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_USB_(1), E_ETH_(1), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PC3
  {{ RESERVED_, E_FMC_(1), RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(1), RESERVED_, RESERVED_, RESERVED_, E_SPDF(1), ESDMMC(2), E_ETH_(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PC4
  {{ RESERVED_, E_I2S_(4), E_I2S_(1), E_DFSD(1), E_PSSI(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SPDF(1), E_OSPI(1), E_ETH_(1), E_FMC_(1), E_TMR_(1), E_LTDC(1), E_SYS_(1)}}, //PC5
  {{ RESERVED_, RESERVED_, E_TMR_(3), E_TMR_(8), E_DFSD(1), E_SPI_(2), RESERVED_, E_USRT(6), ESDMMC(1), E_FMC_(1), ESDMMC(2), RESERVED_, ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC6
  {{ E_SYS_(1), RESERVED_, E_TMR_(3), E_TMR_(8), E_DFSD(1), RESERVED_, E_SPI_(3), E_USRT(6), ESDMMC(1), E_FMC_(1), ESDMMC(2), E_SWP_(1), ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC7
  {{ E_SYS_(1), RESERVED_, E_TMR_(3), E_TMR_(8), RESERVED_, RESERVED_, RESERVED_, E_USRT(6), E_UART(5), E_FMC_(1), E_FMC_(1), E_SWP_(1), ESDMMC(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PC8
  {{ E_MCO_(1), RESERVED_, E_TMR_(3), E_TMR_(8), E_I2C_(3), E_SPI_(1), E_I2C_(5), RESERVED_, E_UART(5), E_OSPI(1), E_LTDC(1), E_SWP_(1), ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC9
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_I2C_(5), RESERVED_, E_SPI_(3), E_USRT(3), E_UART(4), E_OSPI(1), E_LTDC(1), E_SWP_(1), ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC10
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_I2C_(5), RESERVED_, E_SPI_(3), E_USRT(3), E_UART(4), E_OSPI(1), RESERVED_, RESERVED_, ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC11
  {{ E_SYS_(1), E_FMC_(1), E_TMR(15), RESERVED_, E_I2C_(5), E_SPI_(6), E_SPI_(3), E_USRT(3), E_UART(5), RESERVED_, RESERVED_, RESERVED_, ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PC12
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PC13
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PC14
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PC15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_UART(4), EFDCAN(1), RESERVED_, E_UART(9), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PD0
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_UART(4), EFDCAN(1), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD1
  {{ E_SYS_(1), E_FMC_(1), E_TMR_(3), RESERVED_, E_TMR(15), RESERVED_, RESERVED_, RESERVED_, E_UART(5), E_LTDC(1), RESERVED_, RESERVED_, ESDMMC(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PD2
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(2), RESERVED_, E_USRT(2), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PD3
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_USRT(2), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD4
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_USRT(2), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD5
  {{ RESERVED_, E_I2S_(4), E_I2S_(1), E_DFSD(1), E_DFSD(1), E_SPI_(3), E_I2S_(1), E_USRT(2), E_I2S_(4), RESERVED_, E_OSPI(1), ESDMMC(2), E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PD6
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(1), E_DFSD(1), E_USRT(2), RESERVED_, E_SPDF(1), E_OSPI(1), ESDMMC(2), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD7
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_USRT(3), RESERVED_, E_SPDF(1), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD8
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_USRT(3), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD9
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_USRT(3), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PD10
  {{ RESERVED_, RESERVED_, RESERVED_, E_LPTM(2), E_I2C_(4), RESERVED_, RESERVED_, E_USRT(3), RESERVED_, E_OSPI(1), E_I2S_(4), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD11
  {{ RESERVED_, E_LPTM(1), E_TMR_(4), E_LPTM(2), E_I2C_(4), EFDCAN(3), RESERVED_, E_USRT(3), RESERVED_, E_OSPI(1), E_I2S_(4), RESERVED_, E_FMC_(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PD12
  {{ RESERVED_, E_LPTM(1), E_TMR_(4), RESERVED_, E_I2C_(4), EFDCAN(3), RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_I2S_(4), E_UART(9), E_FMC_(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PD13
  {{ RESERVED_, RESERVED_, E_TMR_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_UART(8), RESERVED_, RESERVED_, E_UART(9), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD14
  {{ RESERVED_, RESERVED_, E_TMR_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_UART(8), RESERVED_, RESERVED_, E_UART(9), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PD15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, E_LPTM(1), E_TMR_(4), RESERVED_, E_LPTM(2), RESERVED_, RESERVED_, RESERVED_, E_UART(8), RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PE0
  {{ RESERVED_, E_LPTM(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_UART(8), RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PE1
  {{ E_SYS_(1), RESERVED_, E_I2S_(1), RESERVED_, EUSRT(10), E_SPI_(4), E_I2S_(1), RESERVED_, E_I2S_(4), E_OSPI(1), E_I2S_(4), E_ETH_(1), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PE2
  {{ E_SYS_(1), RESERVED_, RESERVED_, RESERVED_, E_TMR(15), RESERVED_, E_I2S_(1), RESERVED_, E_I2S_(4), RESERVED_, RESERVED_, EUSRT(10), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PE3
  {{ E_SYS_(1), RESERVED_, E_I2S_(1), E_DFSD(1), E_TMR(15), E_SPI_(4), E_I2S_(1), RESERVED_, E_I2S_(4), RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PE4
  {{ E_SYS_(1), RESERVED_, E_I2S_(1), E_DFSD(1), E_TMR(15), E_SPI_(4), E_I2S_(1), RESERVED_, E_I2S_(4), RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PE5
  {{ E_SYS_(1), E_TMR_(1), E_I2S_(1), RESERVED_, E_TMR(15), E_SPI_(4), E_I2S_(1), RESERVED_, E_I2S_(4), E_I2S_(4), E_I2S_(4), E_TMR_(1), E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PE6
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_UART(7), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PE7
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_UART(7), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), E_TMR_(2), RESERVED_, E_SYS_(1)}}, //PE8
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_UART(7), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PE9
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, RESERVED_, RESERVED_, E_UART(7), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PE10
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2S_(4), E_OSPI(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PE11
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), E_TMR_(1), E_LTDC(1), E_SYS_(1)}}, //PE12
  {{ RESERVED_, E_TMR_(1), RESERVED_, E_DFSD(1), RESERVED_, E_SPI_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), E_TMR_(2), E_LTDC(1), E_SYS_(1)}}, //PE13
  {{ RESERVED_, E_TMR_(1), RESERVED_, RESERVED_, RESERVED_, E_SPI_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2S_(4), RESERVED_, E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PE14
  {{ RESERVED_, E_TMR_(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, EUSRT(10), E_FMC_(1), E_TMR_(1), E_LTDC(1), E_SYS_(1)}}, //PE15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2C_(2), RESERVED_, E_I2C_(5), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF0
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2C_(2), RESERVED_, E_I2C_(5), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF1
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2C_(2), RESERVED_, E_I2C_(5), RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF2
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF3
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PF4
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PF5
  {{ RESERVED_, E_TMR(16), EFDCAN(3), RESERVED_, RESERVED_, E_SPI_(5), E_I2S_(1), E_UART(7), E_I2S_(4), RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF6
  {{ RESERVED_, E_TMR(17), EFDCAN(3), RESERVED_, RESERVED_, E_SPI_(5), E_I2S_(1), E_UART(7), E_I2S_(4), RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF7
  {{ RESERVED_, E_TMR(16), RESERVED_, RESERVED_, RESERVED_, E_SPI_(5), E_I2S_(1), E_UART(7), E_I2S_(4), E_TMR(13), E_OSPI(1), RESERVED_, RESERVED_, E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF8
  {{ RESERVED_, E_TMR(17), RESERVED_, RESERVED_, RESERVED_, E_SPI_(5), E_I2S_(1), E_UART(7), E_I2S_(4), E_TMR(14), E_OSPI(1), RESERVED_, RESERVED_, E_TMR(23), RESERVED_, E_SYS_(1)}}, //PF9
  {{ RESERVED_, E_TMR(16), E_I2S_(1), RESERVED_, E_PSSI(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_I2S_(4), RESERVED_, RESERVED_, E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PF10
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SPI_(5), RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_I2S_(4), RESERVED_, E_FMC_(1), E_PSSI(1), E_TMR(24), E_SYS_(1)}}, //PF11
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_TMR(24), E_SYS_(1)}}, //PF12
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_I2C_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_TMR(24), E_SYS_(1)}}, //PF13
  {{ RESERVED_, RESERVED_, RESERVED_, E_DFSD(1), E_I2C_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, E_TMR(24), E_SYS_(1)}}, //PF14
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2C_(4), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PF15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_UART(9), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PG0
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_UART(9), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PG1
  {{ RESERVED_, RESERVED_, RESERVED_, E_TMR_(8), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_TMR_(8), E_FMC_(1), RESERVED_, E_TMR(24), E_SYS_(1)}}, //PG2
  {{ RESERVED_, RESERVED_, RESERVED_, E_TMR_(8), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_TMR_(8), E_FMC_(1), E_TMR(23), RESERVED_, E_SYS_(1)}}, //PG3
  {{ RESERVED_, E_TMR_(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_TMR_(1), E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PG4
  {{ RESERVED_, E_TMR_(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_FMC_(1), RESERVED_, RESERVED_, E_SYS_(1)}}, //PG5
  {{ RESERVED_, E_TMR(17), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PG6
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2S_(1), E_USRT(6), RESERVED_, E_OSPI(1), RESERVED_, RESERVED_, E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PG7
  {{ RESERVED_, RESERVED_, RESERVED_, E_TMR_(8), RESERVED_, E_SPI_(6), RESERVED_, E_USRT(6), E_SPDF(1), RESERVED_, RESERVED_, E_ETH_(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PG8
  {{ RESERVED_, RESERVED_, EFDCAN(3), RESERVED_, RESERVED_, E_SPI_(1), RESERVED_, E_USRT(6), E_SPDF(1), E_OSPI(1), E_I2S_(4), ESDMMC(2), E_FMC_(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PG9
  {{ RESERVED_, RESERVED_, EFDCAN(3), E_OSPI(1), RESERVED_, E_SPI_(1), RESERVED_, RESERVED_, RESERVED_, E_LTDC(1), E_I2S_(4), ESDMMC(2), E_FMC_(1), E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PG10
  {{ RESERVED_, E_LPTM(1), RESERVED_, RESERVED_, EUSRT(10), E_SPI_(1), RESERVED_, RESERVED_, E_SPDF(1), E_OSPI(1), ESDMMC(2), E_ETH_(1), RESERVED_, E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PG11
  {{ RESERVED_, E_LPTM(1), RESERVED_, E_OSPI(1), EUSRT(10), E_SPI_(6), RESERVED_, E_USRT(6), E_SPDF(1), E_LTDC(1), ESDMMC(2), E_ETH_(1), E_FMC_(1), E_TMR(23), E_LTDC(1), E_SYS_(1)}}, //PG12
  {{ E_SYS_(1), E_LPTM(1), RESERVED_, RESERVED_, EUSRT(10), E_SPI_(6), RESERVED_, E_USRT(6), RESERVED_, RESERVED_, ESDMMC(2), E_ETH_(1), E_FMC_(1), E_TMR(23), E_LTDC(1), E_SYS_(1)}}, //PG13
  {{ E_SYS_(1), E_LPTM(1), RESERVED_, RESERVED_, EUSRT(10), E_SPI_(6), RESERVED_, E_USRT(6), RESERVED_, E_OSPI(1), ESDMMC(2), E_ETH_(1), E_FMC_(1), E_TMR(23), E_LTDC(1), E_SYS_(1)}}, //PG14
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_USRT(6), RESERVED_, E_OSPI(1), RESERVED_, EUSRT(10), E_FMC_(1), E_PSSI(1), RESERVED_, E_SYS_(1)}}, //PG15
  //   0           1          2          3          4         5           6         7          8           9          10        11         12          13        14          15
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PH0
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_SYS_(1)}}, //PH1
  {{ RESERVED_, E_LPTM(1), RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_I2S_(4), E_ETH_(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PH2
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_OSPI(1), E_I2S_(4), E_ETH_(1), E_FMC_(1), RESERVED_, E_LTDC(1), E_SYS_(1)}}, //PH3
  {{ RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_I2C_(2), RESERVED_, RESERVED_, RESERVED_, RESERVED_, E_LTDC(1), E_USB_(1), RESERVED_, RESERVED_, E_PSSI(1), E_LTDC(1), E_SYS_(1)}}, //PH4
